app/controllers/user_controller.rb

UPDATE "users" SET "updated_at" = $1, "currency_from" = $2, "currency_to" = $3 WHERE "users"."id" = $4  [["updated_at", "2024-02-06 07:41:36.070927"], ["currency_from", "GBP"], ["currency_to", "USD"], ["id", 1]]
---
  def update
    @user = current_user
    if @user.update(user_params)